OSCCAR/tutorials/multiphase/twoPhaseEulerFoam/RAS/DeenSquareBubbleColumn/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    // Select faces on the bottom of the bubble column to create the inlet
    // patch from.
    {
        name    inlet;
        type    faceSet;
        action  new;
        source  boxToFace;
        sourceInfo
        {
            box (-0.015 -0.015 -1)(0.015 0.015 0.0001);
        }
    }

    // Convert the faceSet to a faceZoneSet so that createPatch can use the
    // faces to create the actual patch in the boundary definition.
    {
        name    inlet;
        type    faceZoneSet;
        action  new;
        source  setToFaceZone;
        sourceInfo
        {
            faceSet inlet;
        }
    }
);

// ************************************************************************* //
